---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.CreateStringOfType(System.String,System.String)
source: html/13eb0552-410a-98cb-6292-d01aac02abde.htm
---
# Autodesk.Revit.DB.IFC.IFCData.CreateStringOfType Method

Creates a string data object of the specified type.

## Syntax (C#)
```csharp
public static IFCData CreateStringOfType(
	string value,
	string typeName
)
```

## Parameters
- **value** (`System.String`) - The string value.
- **typeName** (`System.String`) - The type name.

## Returns
The IFCData object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null